/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	CONFIGURE GRAPHIC

	Copyright(c) 1997-2003 BNSoft Corp.

	그룹 : BASIC API
	구분 : 설정
	등급 : 비공개																					{{BNS_INTERNALCODE()}}
	버전 : 1.06
	일자 : 2003.09.22
	성명 : 박상호,길령환
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

//-------------------------------------------------------------------------------------------------	{{BNS_INTERNALCODE(+)}}
#ifndef		_BNSOFT_CONFIGGR_H_
#define		_BNSOFT_CONFIGGR_H_

//-------------------------------------------------------------------------------------------------
//	GrMath의 수학관련 변수 및 함수를 사용하는 그래픽인가의 여부.
//	Arc, Pie 등을 그리기 위해서는 1로 정의한다.
#define		FEATURE_MATH_GRAPHIC		1

//-------------------------------------------------------------------------------------------------
//	지원할 그래픽 디바이스의 종류를 지정한다.
//	사용하지 않는 디바이스의 경우 값을 0으로 정의하면 불필요한 소스를 포함하지 않게 된다.
#define		FEATURE_SUPPORT_GRDEV_01	0
#define		FEATURE_SUPPORT_GRDEV_02	0
#define		FEATURE_SUPPORT_GRDEV_08	0
#define		FEATURE_SUPPORT_GRDEV_12	0
#define		FEATURE_SUPPORT_GRDEV_16	1
#define		FEATURE_SUPPORT_GRDEV_24	1
#define		FEATURE_SUPPORT_GRDEV_32	1

//@//-------------------------------------------------------------------------------------------------
//@	체계적인 Unicode 지원을 고려하여 삭제함(길령환)
//@//	Unicode를 지원하는 경우 1로 정의한다.
//@#define		FEATURE_UNICODE_GRAPHIC		1

//-------------------------------------------------------------------------------------------------
//	MultiLingual을 지원하는 경우 1로 정의한다.
#define		FEATURE_SUPPORT_MULTILINGUAL	1

//-------------------------------------------------------------------------------------------------
//	WordBreak를 지원하는 경우 1로 정의한다.
#define		FEATURE_SUPPORT_WORDBREAK	1
#endif	//	_BNSOFT_CONFIGGR_H_
//-------------------------------------------------------------------------------------------------	{{BNS_INTERNALCODE(-)}}
